{
  "backend/main.mo": "Main ICP actor that wires together authorization, blob storage, user profile CRUD, and Stripe checkout/session-status integration with HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report confirming that the egg-product count display feature (showing '6 pcs' / '12 pcs' instead of weight) is implemented in ProductCard.tsx with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON mapping of frontend source files to short summaries describing each component's purpose and recent changes.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for the design-system color tokens in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the MurkiMart React app that mounts the app into a root div and loads the Vite entry script.",
  "frontend/src/App.tsx": "Root app component managing a page-stack navigation system across all routes and showing a FirstVisitModal onboarding overlay for unauthenticated users after a rehydration delay.",
  "frontend/src/components/catalog/ProductCard.tsx": "Product card component that detects egg products by category/name and displays a Hash icon with unit count for eggs, or a Scale icon with weight for all other products.",
  "frontend/src/components/common/SearchBar.tsx": "Sticky search bar with live autocomplete suggestions that uses product.image and product.unit fields from the Product interface.",
  "frontend/src/components/home/CategoryTiles.tsx": "Renders a horizontally scrollable row of category tiles using CATEGORIES data, each tile showing an image/emoji and name, and calling onCategorySelect when clicked.",
  "frontend/src/components/home/CustomerCareContact.tsx": "Displays a styled customer care banner with the MurkiMart support phone number, a live availability badge, and two tap-to-call links.",
  "frontend/src/components/home/FlashDeals.tsx": "Shows a 2-column grid of up to 4 discounted products (≥15% off) alongside a live countdown timer that counts down from a fixed end time.",
  "frontend/src/components/home/ProfileSummary.tsx": "Displays a user account summary card with login/signup prompt or logged-in user info, quick-link buttons for orders/addresses/points/support, and a profile navigation button.",
  "frontend/src/components/home/PromotionalCarousel.tsx": "Auto-advancing banner carousel that cycles through three promotional banners every 4 seconds, with dot indicators for manual navigation.",
  "frontend/src/components/home/QuickAddEssentials.tsx": "Renders a 2-column grid of the top 8 essential products from TOP_ESSENTIALS with a section header and a 'See all' link.",
  "frontend/src/components/layout/BottomNavigation.tsx": "Fixed bottom navigation bar with Home, Categories, Cart (with item count badge), and Profile tabs, highlighting the active page.",
  "frontend/src/components/layout/CartBottomBar.tsx": "Fixed floating bar above the bottom nav that shows cart item count, subtotal, savings, and a checkout button; hidden when the cart is empty.",
  "frontend/src/components/layout/Header.tsx": "Sticky top header displaying the MurkiMart logo, a tappable location indicator, and a delivery time badge.",
  "frontend/src/components/onboarding/FirstVisitModal.tsx": "A modal component shown to first-time visitors that collects a 10-digit phone number and delivery address (house number, street, landmark, locality), then logs the user in and saves their address via Zustand stores.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInstantOrder.ts": "A hook that handles instant 'Buy Now' orders by creating an order record, composing a WhatsApp message with item and address details, opening WhatsApp for confirmation, and navigating to the tracking page.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook for ICP apps, managing AuthClient creation, login/logout flows, identity persistence, and exposing login status flags.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for Stripe configuration checks, setting Stripe config, creating checkout sessions, and checking if the caller is an admin, all using the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Poppins fonts, sets up Tailwind directives, and defines CSS custom properties for the MurkiMart orange/green brand theme in both light and dark modes.",
  "frontend/src/lib/addressStore.ts": "A persisted Zustand store managing a list of delivery addresses with operations to add, delete, select, and retrieve addresses, persisted to localStorage under 'murkimart-addresses'.",
  "frontend/src/lib/authStore.ts": "A persisted Zustand store managing authentication state (logged-in status and user info) with login and logout actions, persisted to localStorage under 'murkimart-auth'.",
  "frontend/src/lib/cartStore.ts": "A Zustand store managing shopping cart state including items, coupon codes, and computed totals (subtotal, savings, delivery fee, total), with actions to add, remove, update quantities, and apply/remove coupons.",
  "frontend/src/lib/languageStore.ts": "Zustand store for managing UI language (English/Hindi) with a translation lookup function and a dictionary of app-wide string keys.",
  "frontend/src/lib/navigationStore.ts": "Zustand store that holds a global navigation callback function, allowing any component to trigger page navigation.",
  "frontend/src/lib/orderStore.ts": "Zustand store for managing orders, including creating new orders, updating order status, and seeding three sample delivered orders.",
  "frontend/src/lib/products.ts": "Defines TypeScript interfaces for Product and Category, and exports static arrays of categories and all products (fruits, vegetables, etc.) with pricing, images, and metadata.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with React Query and Internet Identity providers before mounting to the DOM.",
  "frontend/src/pages/admin/AdminPanel.tsx": "Admin dashboard with four sections (Dashboard, Products, Orders, Analytics) showing revenue stats, order management with status updates, product stock/price editing, and Recharts bar/pie charts for sales data.",
  "frontend/src/pages/Cart.tsx": "Cart page component that displays cart items with quantity controls, coupon input, and a bill summary, with callbacks for checkout and continuing shopping.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that handles address selection/creation, order placement via the order store, and sends an order summary to a WhatsApp number on confirmation.",
  "frontend/src/pages/Home.tsx": "Home page that composes the search bar, promotional carousel, category tiles, quick essentials, customer care contact, flash deals, and profile summary sections.",
  "frontend/src/pages/Login.tsx": "Login page supporting both phone/OTP and email/password authentication modes, with validation and navigation to home on success.",
  "frontend/src/pages/OrderConfirmation.tsx": "Displays a post-order confirmation screen showing order ID, estimated delivery time, payment details, delivery address, and rider info, with buttons to track the order or continue shopping.",
  "frontend/src/pages/OrderTracking.tsx": "Renders a live order tracking page that auto-advances through 5 delivery statuses every 8 seconds, showing a progress bar, step list, map placeholder, and rider contact options with toast notifications.",
  "frontend/src/pages/PaymentFailure.tsx": "Simple full-screen error page shown when payment fails, offering a 'Try Again' button and a 'Back to Cart' button.",
  "frontend/src/pages/PaymentSuccess.tsx": "Simple full-screen success page shown after a successful payment, with a 'Continue Shopping' button.",
  "frontend/src/pages/ProductCatalog.tsx": "Full product listing page with category tabs, search, in-stock filter, and sort options that filter and sort ALL_PRODUCTS using memoized logic, rendering results as a grid of ProductCard components.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying saved addresses, order history, loyalty points, language switcher, FAQ accordion, and a live support chat widget; shows a login prompt when the user is not authenticated.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH-based color tokens, typography/container-query plugins, custom fonts, shadows, border radii, and keyframe animations.",
  "project_state.json": "Project state metadata for MurkiMart, an inventory/shopping list app, tracking existing features (egg count display in ProductCard) and a pending feature request to show counts for eggs while other items show weight."
}