{
  "backend/main.mo": "Main Motoko actor that wires together blob storage, authorization (admin access control), and Stripe integration, exposing endpoints for configuring Stripe, creating checkout sessions, and querying session status.",
  "feature_evidence.json": "Feature evidence report linking the profile/account summary section feature (REQ-38) to its implementation files (ProfileSummary.tsx and Home.tsx) and the components it depends on.",
  "frontend-file-summaries.txt": "Auto-generated JSON map of per-file summaries describing recent changes across frontend source files, used as build/documentation reference.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom property design tokens (colors, radius, chart palette) for both light and dark themes.",
  "frontend/index.html": "Minimal HTML shell for the MurkiMart React app, mounting the app into a `#root` div and loading the Vite entry point.",
  "frontend/src/App.tsx": "Root React component managing a page-stack navigation system across all app pages, and conditionally showing a FirstVisitModal onboarding overlay for unauthenticated users after Zustand rehydration.",
  "frontend/src/components/catalog/ProductCard.tsx": "Product card component displaying image, rating, price with discount badge, and add-to-cart/quantity stepper controls, plus a Buy Now button powered by the useInstantOrder hook.",
  "frontend/src/components/common/SearchBar.tsx": "Sticky search bar with live autocomplete suggestions filtered from ALL_PRODUCTS, supporting optional back button, mic icon, and product selection callbacks.",
  "frontend/src/components/home/CategoryTiles.tsx": "Renders a horizontally scrollable row of category tiles with images/emojis, calling onCategorySelect when a tile is clicked.",
  "frontend/src/components/home/CustomerCareContact.tsx": "Displays a branded customer care banner with a phone number, a tap-to-call CTA button, and availability hours.",
  "frontend/src/components/home/FlashDeals.tsx": "Shows a flash deals section with a live countdown timer and a 2-column grid of products filtered to at least 15% discount.",
  "frontend/src/components/home/ProfileSummary.tsx": "Displays a user account summary card with login/signup prompt or user info, quick-link buttons, and a profile navigation button.",
  "frontend/src/components/home/PromotionalCarousel.tsx": "Auto-advancing banner carousel cycling through three promotional offers every 4 seconds, with dot navigation indicators.",
  "frontend/src/components/home/QuickAddEssentials.tsx": "Renders a 2-column grid of up to 8 top essential products with a section header and a 'See all' link.",
  "frontend/src/components/layout/BottomNavigation.tsx": "Fixed bottom navigation bar with Home, Categories, Cart (with badge), and Profile tabs, highlighting the active page.",
  "frontend/src/components/layout/CartBottomBar.tsx": "Fixed floating checkout bar shown above the bottom nav when the cart has items, displaying item count, savings, and subtotal.",
  "frontend/src/components/layout/Header.tsx": "Sticky top header showing the MurkiMart logo, a tappable delivery location, and a delivery time badge.",
  "frontend/src/components/onboarding/FirstVisitModal.tsx": "A modal component shown to first-time visitors that collects a 10-digit phone number and delivery address (house number, street, landmark, locality), then logs the user in and saves the address via Zustand stores.",
  "frontend/src/hooks/useActor.ts": "A React Query-based hook that creates and caches an ICP backend actor, using an authenticated identity if available or falling back to anonymous, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInstantOrder.ts": "A hook that handles instant 'Buy Now' purchases by creating an order in the order store and opening a pre-filled WhatsApp message to a fixed number for Cash on Delivery confirmation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status for ICP-based authentication.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for backend interactions including checking Stripe configuration, setting Stripe config, creating checkout sessions, and checking if the caller is an admin.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Poppins fonts, sets up Tailwind directives, and defines CSS custom properties for the MurkiMart orange/green brand theme in both light and dark modes.",
  "frontend/src/lib/addressStore.ts": "A persisted Zustand store managing delivery addresses with operations to add, delete, select, and retrieve addresses, stored under the key 'murkimart-addresses'.",
  "frontend/src/lib/authStore.ts": "A persisted Zustand store managing user authentication state (name, phone, email) with login and logout actions, stored under the key 'murkimart-auth'.",
  "frontend/src/lib/cartStore.ts": "A Zustand store managing shopping cart state including items, coupon codes, and computed values (subtotal, savings, total), with free delivery always applied and several predefined valid coupon codes.",
  "frontend/src/lib/languageStore.ts": "Zustand store for managing UI language (English/Hindi) with a translation lookup function and a static translations dictionary for common app strings.",
  "frontend/src/lib/navigationStore.ts": "Zustand store that holds a global navigation callback function, allowing any component to trigger page navigation imperatively.",
  "frontend/src/lib/orderStore.ts": "Zustand store managing order creation, status updates, and order history, with seeded past orders and random rider name assignment.",
  "frontend/src/lib/products.ts": "Defines TypeScript interfaces for Product and Category, and exports static arrays of categories and all products (fruits, vegetables, eggs, meat, etc.) with pricing, images, and metadata.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with React Query, and a custom InternetIdentity authentication provider before mounting to the DOM.",
  "frontend/src/pages/admin/AdminPanel.tsx": "Admin dashboard with four sections—Dashboard, Products, Orders, and Analytics—displaying revenue stats, order counts, stock alerts, bar/pie charts, and order status management controls.",
  "frontend/src/pages/Cart.tsx": "Cart page component displaying cart items with quantity controls, coupon code input, bill summary, and buttons to proceed to checkout or continue shopping.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that handles address selection/creation, order placement via the order store, and sends a WhatsApp message with order details upon confirmation.",
  "frontend/src/pages/Home.tsx": "Home page that composes the search bar, promotional carousel, category tiles, quick-add essentials, customer care contact, flash deals, and profile summary sections.",
  "frontend/src/pages/Login.tsx": "Login page supporting both phone/OTP and email/password authentication modes, with validation and navigation to home on successful login.",
  "frontend/src/pages/OrderConfirmation.tsx": "Displays a post-order confirmation screen showing order ID, estimated delivery time, payment details, delivery address, and rider info. Provides buttons to track the order or continue shopping.",
  "frontend/src/pages/OrderTracking.tsx": "Real-time order tracking page that auto-advances through 5 delivery statuses every 8 seconds with toast notifications and a progress bar. Shows ETA countdown, rider info, and map placeholder.",
  "frontend/src/pages/PaymentFailure.tsx": "Simple error screen shown when a payment fails, offering a retry button and a back-to-cart button.",
  "frontend/src/pages/PaymentSuccess.tsx": "Simple success screen shown after a successful payment, with a continue shopping button.",
  "frontend/src/pages/ProductCatalog.tsx": "Full product listing page with category tabs, search, in-stock filter, and sort options (price, rating). Renders filtered products using ProductCard components.",
  "frontend/src/pages/Profile.tsx": "User profile page showing saved addresses, order history, loyalty points, language switcher, FAQ accordion, and a live chat widget. Redirects unauthenticated users to a login prompt.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and cleaning URL parameters from both query strings and hash-based routes. Provides helpers to store/retrieve values in sessionStorage and remove sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Inter, Poppins), OKLCH-based color tokens (brand orange/green, sidebar, chart colors), border radii, box shadows, and keyframe animations. Enables dark mode via class and includes typography, container-queries, and animate plugins.",
  "project_state.json": "Project state snapshot (version 37) describing MurkiMart, a Blinkit-style quick-commerce app for Murki Jaunpur with orange/green branding, UPI/COD payments, WhatsApp order notifications, and a catalogue of existing and planned features. Also records known issues such as an incomplete product catalog."
}