{
  "backend/main.mo": "Main Motoko actor that wires together blob storage, authorization/access control, and Stripe integration, exposing functions for configuring Stripe, creating checkout sessions, and querying session status.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their corresponding source files, components, test IDs, and confidence levels for the MurkiMart app.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence summaries of key frontend source files including App.tsx, page components, and common components like SearchBar.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "HTML shell for the MurkiMart React app, setting the page title and mounting the React root via the main.tsx module script.",
  "frontend/src/App.tsx": "Root React component managing client-side page navigation state across all MurkiMart screens, conditionally rendering Header, BottomNavigation, CartBottomBar, and the active page component.",
  "frontend/src/components/catalog/ProductCard.tsx": "Product card component displaying emoji image, discount badge, veg indicator, rating, pricing with strikethrough MRP, and an add-to-cart/quantity-selector button integrated with the cart store.",
  "frontend/src/components/common/SearchBar.tsx": "Sticky search bar with real-time autocomplete suggestions filtered from ALL_PRODUCTS, supporting clear and mic buttons, and callbacks for search queries and product selection.",
  "frontend/src/components/home/CategoryTiles.tsx": "Horizontally scrollable row of category tile buttons with images/emoji fallback, triggering a category selection callback when clicked.",
  "frontend/src/components/home/FlashDeals.tsx": "Displays a flash deals section with a live countdown timer and a grid of up to 4 discounted products (≥15% off) from the product catalog.",
  "frontend/src/components/home/PromotionalCarousel.tsx": "Auto-advancing banner carousel that cycles through 3 promotional banners every 4 seconds, with dot navigation indicators.",
  "frontend/src/components/home/QuickAddEssentials.tsx": "Renders a grid of up to 8 top essential products with a header and a 'See all' link.",
  "frontend/src/components/layout/BottomNavigation.tsx": "Fixed bottom navigation bar with Home, Categories, Cart (with item count badge), and Profile tabs, highlighting the active page.",
  "frontend/src/components/layout/CartBottomBar.tsx": "Sticky bar above the bottom nav that shows cart item count, savings, subtotal, and a checkout button; hidden when cart is empty.",
  "frontend/src/components/layout/Header.tsx": "Sticky app header displaying the MurkiMart logo, a tappable location selector, and a delivery time badge.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for Stripe configuration status, setting Stripe config, creating checkout sessions, and checking admin status via the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet importing fonts, configuring Tailwind, and defining CSS custom properties for the MurkiMart orange/green brand theme in both light and dark modes.",
  "frontend/src/lib/addressStore.ts": "Zustand store managing saved delivery addresses with operations to add, delete, and select addresses, seeded with two default entries.",
  "frontend/src/lib/cartStore.ts": "Zustand store managing shopping cart state including item quantities, coupon application, and computed totals (subtotal, delivery fee, savings).",
  "frontend/src/lib/languageStore.ts": "Zustand store for English/Hindi language switching with a translation lookup map covering common UI strings.",
  "frontend/src/lib/orderStore.ts": "Zustand store managing order creation, status updates, and order history, seeded with three sample delivered orders.",
  "frontend/src/lib/products.ts": "Defines the Product interface, a CATEGORIES array with emoji/image metadata, and an ALL_PRODUCTS catalog spanning groceries, dairy, snacks, and more.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminPanel.tsx": "Admin dashboard with four sections—Dashboard, Products, Orders, and Analytics—showing revenue stats, order counts, stock alerts, and charts using Recharts. Supports inline product price/stock editing and order status updates.",
  "frontend/src/pages/Cart.tsx": "Cart page component displaying line items with quantity controls, coupon input, delivery fee banner, and a checkout CTA.",
  "frontend/src/pages/Checkout.tsx": "Checkout page allowing address selection/addition, payment method choice (UPI/card/COD), and order placement with a simulated async delay.",
  "frontend/src/pages/Home.tsx": "Home page composing a search bar, promotional carousel, category tiles, quick-add essentials, and flash deals sections.",
  "frontend/src/pages/OrderConfirmation.tsx": "Displays a post-order confirmation screen showing order ID, estimated delivery time, payment details, delivery address, and rider info. Provides buttons to track the order or continue shopping.",
  "frontend/src/pages/OrderTracking.tsx": "Shows a live order tracking page with a step-by-step status progression, progress bar, ETA countdown, and rider info. Simulates automatic order status advancement every 8 seconds.",
  "frontend/src/pages/PaymentFailure.tsx": "Simple error screen shown when a payment fails, offering buttons to retry the payment or go back to the cart.",
  "frontend/src/pages/PaymentSuccess.tsx": "Simple success screen displayed after a successful payment, with a button to continue shopping.",
  "frontend/src/pages/ProductCatalog.tsx": "Full product listing page with category tabs, search, and filters for veg-only, in-stock, and sort order. Uses memoized filtering and sorting over the full product list.",
  "frontend/src/pages/Profile.tsx": "User profile page with collapsible sections for saved addresses, order history, loyalty points, language selection, and support. Includes a live chat widget and FAQ accordion.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including brand colors (orange/green), typography, border radius, shadows, and animation keyframes for the MurkiMart app.",
  "project_state.json": "Project state manifest describing MurkiMart, a quick-commerce grocery delivery app for Murki Jaunpur, including architecture notes, required image assets, and a list of implemented features."
}