{
  "kind": "build_request",
  "title": "Retry: Add profile/account summary section to Home page bottom",
  "projectName": "MurkiMart",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Add a profile/account summary section at the bottom of the Home page (frontend/src/pages/Home.tsx). The section should display: (1) the logged-in user's name and phone number sourced from authStore, or a 'Login / Sign Up' prompt if not authenticated; (2) a row of quick-link cards/buttons for 'My Orders', 'Saved Addresses', 'Loyalty Points', and 'Help & Support' — each tapping navigates to the Profile page; (3) a 'Go to Profile' button that navigates to the Profile page. Style the section consistently with the MurkiMart orange (#F97316) and green (#16A34A) theme, using card/tile layout with icons. Place it below the CustomerCareContact banner and above any footer padding.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "retry the build with the profile section and cart additions to the bottom of the homepage"
        ]
      },
      "acceptanceCriteria": [
        "When the user is logged in (authStore.isLoggedIn === true), the section displays the user's name and phone number from authStore",
        "When the user is not logged in, the section displays a 'Login / Sign Up' prompt card",
        "A row of four quick-link cards is shown: 'My Orders', 'Saved Addresses', 'Loyalty Points', and 'Help & Support', each with an icon",
        "Tapping any quick-link card navigates to the Profile page",
        "A 'Go to Profile' button is present and navigates to the Profile page",
        "The section is placed below the CustomerCareContact banner on the Home page",
        "The section uses MurkiMart orange (#F97316) and green (#16A34A) consistently in card/tile styling"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed in frontend.immutablePaths",
    "Use existing authStore (frontend/src/lib/authStore.ts) for authentication state — do not create a new store",
    "Navigation must use the existing navigationStore or page-stack navigation pattern already in use in App.tsx"
  ],
  "nonGoals": [
    "Do not add new backend endpoints or modify backend/main.mo",
    "Do not create new auth or address store files — use existing ones",
    "Do not modify the Profile page itself"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}