{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "MurkiMart — Hyperlocal Quick Commerce Frontend",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Apply MurkiMart orange/green visual theme with branding and delivery promise badge",
      "acceptanceCriteria": [
        "Orange and green color palette applied consistently across all screens",
        "'MurkiMart' branding visible in header/logo",
        "10-15 min delivery promise badge displayed prominently on home screen",
        "All buttons, CTAs, and interactive elements follow the orange/green palette"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add MurkiMart brand colors (orange #F97316, green #16A34A) as CSS custom properties and update global typography to use clean sans-serif fonts. Wire the generated logo image from frontend/public/assets/generated/murkimart-logo.dim_400x120.png as background or asset reference for branding consistency."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind theme with MurkiMart color palette: primary orange (#F97316), secondary green (#16A34A), and white backgrounds. Configure custom brand colors for buttons, badges, and interactive elements."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "create",
          "description": "Create a header component displaying the MurkiMart logo (using frontend/public/assets/generated/murkimart-logo.dim_400x120.png), delivery promise badge ('Delivery in 10-15 mins' with orange background), and location selector. Include sticky positioning for persistent visibility."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "create",
          "description": "Create app layout wrapper that includes the Header component and renders children content. Ensure the orange/green theme is applied consistently through className props and Tailwind utilities."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Build Home Feed with carousel, quick-add essentials, category tiles, and flash deals",
      "acceptanceCriteria": [
        "Carousel banners auto-scroll and display at least 3 promotional slides",
        "Top 20 essentials quick-add section renders with product image, name, price, and Add button",
        "Category tiles display with icons and navigate to filtered product catalog",
        "Flash Deals section shows discounted items with countdown timers",
        "Home feed is scrollable vertically with sticky search bar at top"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "create",
          "description": "Create Home Feed page with: auto-scrolling promotional carousel (using frontend/public/assets/generated/banner-groceries.dim_800x300.png, frontend/public/assets/generated/banner-dairy.dim_800x300.png, frontend/public/assets/generated/banner-snacks.dim_800x300.png), 'MurkiMart Now' section with top 20 essentials (Milk, Bread, Eggs, Parle-G, Atta, Rice, Dal, Onions, Tomatoes, Bananas, Butter, Paneer, Curd, Biscuits, Chips, Maggi, Cooking Oil, Sugar, Salt, Tea), horizontal scrollable category tiles (using category icon images from frontend/public/assets/generated/category-*.dim_96x96.png), and Flash Deals section with countdown timers. Include sticky search bar at top."
        },
        {
          "path": "frontend/src/components/home/PromotionalCarousel.tsx",
          "operation": "create",
          "description": "Create auto-scrolling carousel component that cycles through promotional banner images (frontend/public/assets/generated/banner-groceries.dim_800x300.png, frontend/public/assets/generated/banner-dairy.dim_800x300.png, frontend/public/assets/generated/banner-snacks.dim_800x300.png). Include navigation dots and auto-advance every 4 seconds."
        },
        {
          "path": "frontend/src/components/home/QuickAddEssentials.tsx",
          "operation": "create",
          "description": "Create 'MurkiMart Now' quick-add section displaying the top 20 essentials with product thumbnails, names, prices, and Add buttons. Wire to cart state for adding items."
        },
        {
          "path": "frontend/src/components/home/CategoryTiles.tsx",
          "operation": "create",
          "description": "Create horizontal scrollable category tiles component. Each tile displays a category icon (frontend/public/assets/generated/category-fruits.dim_96x96.png, category-dairy.dim_96x96.png, category-snacks.dim_96x96.png, category-personal-care.dim_96x96.png, category-pharmacy.dim_96x96.png, category-household.dim_96x96.png, category-electronics.dim_96x96.png, category-pet.dim_96x96.png) and category name. On click, navigate to product catalog with category filter applied."
        },
        {
          "path": "frontend/src/components/home/FlashDeals.tsx",
          "operation": "create",
          "description": "Create Flash Deals section displaying time-limited offers with discount badges and countdown timers. Include mock deal data with expiration times."
        },
        {
          "path": "frontend/src/components/common/SearchBar.tsx",
          "operation": "create",
          "description": "Create sticky search bar component with input field and search icon. Position at top of Home Feed and wire to product search functionality."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Build Product Catalog with grid view, filters, search, and quantity selectors",
      "acceptanceCriteria": [
        "Product grid displays in 2-column layout with all required fields",
        "MRP displayed with strikethrough; discounted price shown in bold",
        "Discount percentage badge shown on eligible products",
        "Add button turns into +/- quantity selector after first tap",
        "Filter panel allows filtering by price range, brand, and veg/non-veg",
        "Search bar shows autocomplete suggestions as user types",
        "Out-of-stock products show disabled state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductCatalog.tsx",
          "operation": "create",
          "description": "Create Product Catalog page with 2-column grid layout. Display products with image, name, quantity/weight, MRP (strikethrough), discounted price (bold), discount percentage badge, star rating, and Add/quantity-selector button. Include filter controls (price range, brand, veg/non-veg toggle, category) and search with autocomplete. Show out-of-stock state for unavailable items. Wire to mock product data or backend product query capabilities."
        },
        {
          "path": "frontend/src/components/catalog/ProductCard.tsx",
          "operation": "create",
          "description": "Create reusable product card component displaying product details: image, name, MRP (strikethrough), discounted price, discount badge, rating, and Add/quantity-selector button. Handle add-to-cart interaction and quantity updates."
        },
        {
          "path": "frontend/src/components/catalog/FilterPanel.tsx",
          "operation": "create",
          "description": "Create filter panel component with controls for price range slider, brand multi-select, veg/non-veg toggle, and category dropdown. Apply filters to product list on user interaction."
        },
        {
          "path": "frontend/src/components/catalog/ProductSearch.tsx",
          "operation": "create",
          "description": "Create product search component with autocomplete suggestions. Display matching products as user types query."
        },
        {
          "path": "frontend/src/hooks/useProducts.ts",
          "operation": "create",
          "description": "Create hook for fetching and managing product data. Support filtering by category, search query, and filter criteria. Return product list and loading state."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Build persistent Cart with sticky bottom bar, cart screen, and order summary",
      "acceptanceCriteria": [
        "Sticky cart bar visible on Home, Catalog, and Product screens",
        "Cart bar shows correct item count, subtotal, and savings",
        "Tapping cart bar opens full cart screen",
        "Quantity can be increased/decreased/removed from cart screen",
        "Delivery fee shows ₹0 when subtotal exceeds ₹199, otherwise ₹25-₹50",
        "Coupon code input applies mock discount to total",
        "Order summary section shows subtotal, delivery fee, savings, and total"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/cart/CartBottomBar.tsx",
          "operation": "create",
          "description": "Create sticky bottom cart bar visible on all non-checkout screens. Display item count badge, subtotal, savings amount, and 'Checkout' CTA button styled with orange background. On click, navigate to cart screen."
        },
        {
          "path": "frontend/src/pages/Cart.tsx",
          "operation": "create",
          "description": "Create full cart screen listing all added items with quantity controls (+/-), individual item prices, and remove button. Show order summary with subtotal, delivery fee (₹0 if subtotal > ₹199, else ₹25-₹50), total savings, and final payable amount. Include coupon/promo code input field that applies mock discount."
        },
        {
          "path": "frontend/src/components/cart/CartItem.tsx",
          "operation": "create",
          "description": "Create cart item component displaying product image, name, price, quantity selector, and remove button. Wire to cart state for quantity updates and removal."
        },
        {
          "path": "frontend/src/components/cart/OrderSummary.tsx",
          "operation": "create",
          "description": "Create order summary component showing subtotal, delivery fee, savings, coupon discount, and total payable amount. Apply delivery fee logic: free (₹0) above ₹199, otherwise ₹25-₹50."
        },
        {
          "path": "frontend/src/hooks/useCart.ts",
          "operation": "create",
          "description": "Create cart state management hook using React Context or Zustand. Track cart items (product, quantity), calculate subtotal, savings, delivery fee, and total. Provide addToCart, updateQuantity, removeFromCart, and applyCoupon functions."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Build Checkout and Delivery Address screen with payment methods and order confirmation",
      "acceptanceCriteria": [
        "Saved addresses displayed with option to select or add new",
        "New address form includes house number, street, landmark, and locality dropdown",
        "Locality dropdown contains Murki Jaunpur area names",
        "Payment method selection shows UPI, Card, and COD options",
        "Place Order creates an order record and shows confirmation screen",
        "Confirmation screen shows order ID, estimated delivery time (10-15 mins), and summary"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Checkout.tsx",
          "operation": "create",
          "description": "Create Checkout page with saved addresses section (pre-populated with sample Murki Jaunpur addresses), add new address form (house number, street, landmark, locality dropdown with Murki Jaunpur areas), and payment methods section (UPI with Google Pay/PhonePe icons, Credit/Debit Card, Cash on Delivery). Include Place Order button that navigates to order confirmation. Use the Stripe component for payment processing when payment method is UPI or Card. Verify the Stripe component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/checkout/AddressSelector.tsx",
          "operation": "create",
          "description": "Create address selector component displaying saved addresses with radio selection. Include 'Add New Address' button that opens address form."
        },
        {
          "path": "frontend/src/components/checkout/AddressForm.tsx",
          "operation": "create",
          "description": "Create address form component with fields: house number, street, landmark, and locality dropdown (Murki Bazar, Jaunpur Road, Station Area, etc.). Save address to user profile or cart context."
        },
        {
          "path": "frontend/src/components/checkout/PaymentMethodSelector.tsx",
          "operation": "create",
          "description": "Create payment method selector with options: UPI (Google Pay/PhonePe icons), Credit/Debit Card, and Cash on Delivery. Wire to Stripe checkout when UPI or Card is selected. For COD, proceed directly to order creation. Verify the Stripe component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/OrderConfirmation.tsx",
          "operation": "create",
          "description": "Create order confirmation screen showing order ID, estimated delivery time (10-15 mins), order summary (items, total), and navigation to order tracking. Display success message with orange/green theme."
        },
        {
          "path": "frontend/src/hooks/useCheckout.ts",
          "operation": "create",
          "description": "Create checkout hook for handling order placement. Create order record, wire to Stripe payment flow when required, and navigate to confirmation screen on success. Verify the Stripe component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PaymentSuccess.tsx",
          "operation": "create",
          "description": "Create PaymentSuccess component to handle successful Stripe payment. Display success message and redirect to OrderConfirmation. Verify the Stripe component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PaymentFailure.tsx",
          "operation": "create",
          "description": "Create PaymentFailure component to handle failed Stripe payment. Display error message and offer retry or return to cart options. Verify the Stripe component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Build Order Tracking screen with status timeline, rider info, and ETA countdown",
      "acceptanceCriteria": [
        "Order status timeline shows all 5 steps with icons",
        "Completed steps show checkmark and are highlighted",
        "Rider name and avatar displayed during 'Out for Delivery' stage",
        "ETA countdown timer updates every second",
        "Animated progress bar reflects overall delivery progress",
        "Order item summary visible at the bottom of the screen"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OrderTracking.tsx",
          "operation": "create",
          "description": "Create Order Tracking page with visual status timeline (Order Confirmed → Being Prepared → Picked Up by Rider → Out for Delivery → Delivered). Completed steps show checkmark and orange/green highlight. Display rider name, avatar (frontend/public/assets/generated/rider-avatar.dim_128x128.png), and ETA countdown ('Rider arriving in X mins') during 'Out for Delivery' stage. Include animated progress bar at top and order summary at bottom."
        },
        {
          "path": "frontend/src/components/tracking/StatusTimeline.tsx",
          "operation": "create",
          "description": "Create status timeline component displaying 5 order stages with icons. Highlight completed steps with checkmarks and orange/green colors. Show current active step."
        },
        {
          "path": "frontend/src/components/tracking/RiderInfo.tsx",
          "operation": "create",
          "description": "Create rider info component showing rider avatar (frontend/public/assets/generated/rider-avatar.dim_128x128.png), name, and ETA countdown timer. Display only during 'Out for Delivery' stage."
        },
        {
          "path": "frontend/src/components/tracking/ProgressBar.tsx",
          "operation": "create",
          "description": "Create animated progress bar component reflecting delivery progress percentage. Wire to order status to calculate progress."
        },
        {
          "path": "frontend/src/hooks/useOrderTracking.ts",
          "operation": "create",
          "description": "Create order tracking hook that simulates live order status updates and ETA countdown. Return current status, rider info, and ETA remaining."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Build User Profile screen with addresses, order history, loyalty points, language toggle, and support",
      "acceptanceCriteria": [
        "Profile screen has all 5 sections listed",
        "Saved addresses can be viewed and deleted",
        "Order history shows at least 3 mock past orders with correct fields",
        "Loyalty points balance displayed with redemption value",
        "Language toggle switches key UI labels between English and Hindi",
        "Chat support section opens a simple FAQ + mock chat interface"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Profile.tsx",
          "operation": "create",
          "description": "Create User Profile page with 5 sections: (1) Saved Addresses list with edit/delete options, (2) Order History showing past orders (date, items, total, status badge), (3) Loyalty Points balance with points-to-rupees conversion ('120 points = ₹12 off'), (4) Language Toggle (English/Hindi) switching key UI labels, (5) Help & Support with FAQ items and 'Chat Support' button opening mock chat UI. Use the authorization component for user profile data management. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/profile/AddressList.tsx",
          "operation": "create",
          "description": "Create saved addresses list component with view and delete functionality. Wire to user profile or address storage. Use the authorization component for managing user addresses. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/profile/OrderHistory.tsx",
          "operation": "create",
          "description": "Create order history component displaying past orders with date, items, total, and status badge. Fetch from order storage or display mock data."
        },
        {
          "path": "frontend/src/components/profile/LoyaltyPoints.tsx",
          "operation": "create",
          "description": "Create loyalty points component showing points balance and redemption value (e.g., '120 points = ₹12 off'). Display in orange/green theme."
        },
        {
          "path": "frontend/src/components/profile/LanguageToggle.tsx",
          "operation": "create",
          "description": "Create language toggle component switching between English and Hindi. Store language preference in context or localStorage and update key UI labels."
        },
        {
          "path": "frontend/src/components/profile/HelpSupport.tsx",
          "operation": "create",
          "description": "Create Help & Support component with FAQ items and 'Chat Support' button. Chat button opens a mock chat interface overlay."
        },
        {
          "path": "frontend/src/hooks/useUserProfile.ts",
          "operation": "create",
          "description": "Create user profile hook for fetching and managing user data (addresses, orders, loyalty points). Use the authorization component's getCallerUserProfile and saveCallerUserProfile methods. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Build Admin Panel with dashboard, product management, orders, and analytics",
      "acceptanceCriteria": [
        "Admin panel accessible at /admin route",
        "Dashboard shows 4 metric cards with live data from backend",
        "Product table allows inline editing of price and stock quantity",
        "Orders list shows all orders with status change controls",
        "Analytics section includes peak hours chart, top products list, and category revenue chart",
        "Sidebar navigation links to Dashboard, Products, Orders, and Analytics sections"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminPanel.tsx",
          "operation": "create",
          "description": "Create Admin Panel page accessible via /admin route. Include sidebar navigation (Dashboard, Products, Orders, Analytics) and route to respective admin sections. Use orange/green theme consistent with main app. Use the authorization component to guard admin-only access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboard.tsx",
          "operation": "create",
          "description": "Create admin dashboard with 4 metric cards: Total Orders Today, Revenue Today, Active Riders, Items Out of Stock. Fetch live data from backend or display mock metrics."
        },
        {
          "path": "frontend/src/pages/admin/AdminProducts.tsx",
          "operation": "create",
          "description": "Create product management table listing all products. Allow inline editing of stock quantity and price. Wire to backend product update capabilities or local state."
        },
        {
          "path": "frontend/src/pages/admin/AdminOrders.tsx",
          "operation": "create",
          "description": "Create orders list showing all orders with details and status change controls. Allow admin to update order status (Order Confirmed, Being Prepared, etc.). Wire to backend order update capabilities."
        },
        {
          "path": "frontend/src/pages/admin/AdminAnalytics.tsx",
          "operation": "create",
          "description": "Create analytics section with: peak hours chart (orders by hour), top-selling products list, and category-wise revenue breakdown chart. Use chart library (e.g., Recharts) for visualizations."
        },
        {
          "path": "frontend/src/components/admin/AdminSidebar.tsx",
          "operation": "create",
          "description": "Create admin sidebar navigation with links to Dashboard, Products, Orders, and Analytics sections. Highlight active section."
        },
        {
          "path": "frontend/src/components/admin/StripeSetup.tsx",
          "operation": "create",
          "description": "Create Stripe configuration component for admin to set Stripe secret key and allowed countries. Use the Stripe component's isStripeConfigured and setStripeConfiguration methods. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminData.ts",
          "operation": "create",
          "description": "Create admin data hook for fetching dashboard metrics, products, orders, and analytics. Use the authorization component to ensure admin-only access. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add bottom navigation bar with Home, Categories, Cart, and Profile tabs",
      "acceptanceCriteria": [
        "Bottom navigation bar visible on Home, Categories, Cart, and Profile screens",
        "Active tab highlighted in orange",
        "Cart tab shows item count badge when cart is non-empty",
        "Tapping each tab navigates to the correct screen",
        "Navigation state persists correctly between tab switches"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/BottomNavigation.tsx",
          "operation": "create",
          "description": "Create bottom navigation bar with 4 tabs: Home (house icon), Categories (grid icon), Cart (cart icon with item count badge), and Profile (person icon). Active tab highlighted in orange. Cart badge updates in real-time based on cart state. Wire to router for navigation."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire all created pages into the app router: Home (/), ProductCatalog (/catalog), Cart (/cart), Checkout (/checkout), OrderConfirmation (/order-confirmation), OrderTracking (/order-tracking), Profile (/profile), AdminPanel (/admin), PaymentSuccess (/payment-success), PaymentFailure (/payment-failure). Include BottomNavigation component in AppLayout for persistent navigation. Use the authorization component to guard admin routes and user-specific pages. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}